# ============================================================
# Shell / Editor
# ============================================================
brew "zsh"
brew "vim"

# ============================================================
# Git
# ============================================================
brew "git"
brew "gh"
cask "fork"                   # Git GUIクライアント

# ============================================================
# ネットワーク / HTTP
# ============================================================
brew "curl"
brew "wget"

# ============================================================
# UNIX ユーティリティ
# ============================================================
brew "coreutils"              # GNU coreutils (gdate, gls等)
brew "findutils"              # GNU findutils (gfind, gxargs等)
brew "jq"                     # JSON処理
brew "trash"                  # ゴミ箱に移動する rm 代替
brew "imagemagick"            # 画像処理

# ============================================================
# dotfiles 管理
# ============================================================
brew "stow"                   # シンボリックリンク管理
brew "pinentry-mac"           # brew autoupdate --sudo 用

# ============================================================
# 開発環境 / ランタイム管理
# ============================================================
brew "mise"                   # ランタイムバージョン管理（Java, Node.js, yarn等）
brew "sbt"                    # Scala ビルドツール
brew "deno"                   # Deno ランタイム

# ============================================================
# API / プロトコル
# ============================================================
brew "grpcurl"                # gRPC CLI クライアント
brew "protobuf"               # Protocol Buffers コンパイラ

# ============================================================
# データベース
# ============================================================
brew "tbls"                   # DB ドキュメント生成
brew "mysql-client"           # mysql CLI（サーバー mysqld は含まない、db-query/Sequel Ace連携用）
cask "sequel-ace"             # MySQL GUIクライアント

# ============================================================
# CI/CD
# ============================================================
brew "circleci"

# ============================================================
# クラウド
# ============================================================
cask "google-cloud-sdk"

# ============================================================
# コンテナ
# ============================================================
cask "docker"

# ============================================================
# セキュリティ / 証明書
# ============================================================
brew "mkcert"                 # ローカルSSL証明書

# ============================================================
# AI
# ============================================================
cask "claude"                 # Claude デスクトップアプリ
cask "codex"                  # OpenAI Codex CLI（コーディングエージェント）
# Claude Code CLI は native installer で管理（install.sh参照）

# ============================================================
# ブラウザ
# ============================================================
cask "google-chrome"

# ============================================================
# コミュニケーション
# ============================================================
cask "slack"
cask "zoom"

# ============================================================
# IDE / エディタ
# ============================================================
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "obsidian"               # vault配下のノート管理

# ============================================================
# ユーティリティアプリ
# ============================================================
cask "google-drive"
cask "google-japanese-ime"
cask "gyazo"                  # スクリーンショット
cask "postman"                # API テストツール

