tap "caskroom/cask"
# cask-versionsで複数versionの管理をできるようにする
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/services"

brew "vim"
brew "zsh"
brew "git"
brew "curl"
brew "peco"

# ゴミ箱に移動させるため
brew "trash"

# linux互換
brew "coreutils"
brew "findutils"

# スクレイピング用
#brew "chromedriver"


# Mac Application installs
cask "google-chrome"
cask "google-backup-and-sync"
cask "google-japanese-ime"

# toolboxでインストールに変更した。
cask "jetbrains-toolbox"

cask "slack"
cask "dropbox"
cask "sequel-pro"
cask "sourcetree"
cask "gyazo"
cask "skype"
cask "visual-studio-code"

# officeの代わり
cask "libreoffice"

# 画像編集ソフト
cask "gimp"

# 構成管理ツール
brew "awscli"
brew "terraform"
brew "ansible"

cask "docker"
cask "kitematic"

# plantUML用
brew "graphviz"

# ブロックチェーン関係
#tap "ethereum/ethereum"
#brew "ethereum"
#brew "solidity"
#cask "ganache"

# あなたと一緒
cask install java8


# 英字キーボード
cask karabiner-elements
